In [7]:
import pandas as pd
import numpy as np
import functools
import itertools
import datetime
from io import StringIO

In [10]:
numbers = pd.DataFrame(
    {"one": [0, 3, 6, 9], "two": [10, 40, 70, 99], "three": [30, 0, -25, -70]}
)

numbers.loc[numbers.one >= 5, "two"] = -1

numbers

   one  two  three
0    0   10     30
1    3   40      0
2    6   -1    -25
3    9   -1    -70

In [12]:
numbers.loc[numbers.one >= 5, ["two", "three"]] = 666

numbers

   one  two  three
0    0   10     30
1    3   40      0
2    6  666    666
3    9  666    666

In [13]:
numbers.loc[numbers.one < 5, ["two", "three"]] = 0

numbers

   one  two  three
0    0    0      0
1    3    0      0
2    6  666    666
3    9  666    666

In [15]:
numbers_ = pd.DataFrame(
    {"one": [True] * 4, "two": [False] * 4, "three": [True, False] * 2}
)

numbers.where(numbers_, -756)

   one  two  three
0    0 -756      0
1    3 -756   -756
2    6 -756    666
3    9 -756   -756

In [ ]:
numbers = pd.DataFrame(
    {"one": [4, 5, 6, 7], "two": [10, 20, 30, 40], "three": [100, 50, -30, -50]}
)

numbers

In [17]:
numbers["logic"] = np.where(numbers["one"] > 5, "high", "low")

numbers

   one  two  three logic
0    4   10    100   low
1    5   20     50   low
2    6   30    -30  high
3    7   40    -50  high

In [20]:
numbers = pd.DataFrame(
    {"one": [0, 3, 6, 9], "two": [10, 40, 70, 99], "three": [30, 0, -25, -70]}
)

numbers

numbers[numbers.one <= 5]

   one  two  three
0    0   10     30
1    3   40      0

In [21]:
numbers[numbers.one > 5]

   one  two  three
2    6   70    -25
3    9   99    -70

In [8]:
numbers = pd.DataFrame(
    {"one": [0, 3, 6, 9], "two": [10, 40, 70, 99], "three": [30, 0, -25, -70]}
)

numbers

   one  two  three
0    0   10     30
1    3   40      0
2    6   70    -25
3    9   99    -70

In [9]:
numbers.loc[(numbers["two"] < 25) & (numbers["three"] >= -40), "one"]

0    0
Name: one, dtype: int64

In [10]:
numbers.loc[(numbers["two"] > 25) | (numbers["three"] >= -40), "one"]

0    0
1    3
2    6
3    9
Name: one, dtype: int64

In [15]:
numbers.loc[(numbers["two"] > 7) | (numbers["three"] >= 225), "one"] = 999
numbers

   one  two  three
0  999   10     30
1  999   40      0
2  999   70    -25
3  999   99    -70

In [17]:
numbers = pd.DataFrame(
    {"one": [0, 3, 6, 9], "two": [10, 40, 70, 99], "three": [30, 0, -25, -70]}
)

numbers

aValue = 32

numbers.loc[(numbers.three - aValue).abs().argsort()]

   one  two  three
0    0   10     30
1    3   40      0
2    6   70    -25
3    9   99    -70

In [18]:
numbers = pd.DataFrame(
    {"one": [4, 5, 6, 7], "two": [10, 20, 30, 40], "three": [100, 50, -30, -50]}
)

numbers

Crit1 = numbers.one <= 5.5

Crit2 = numbers.two == 10.0

Crit3 = numbers.three > -40.0

AllCrit = Crit1 & Crit2 & Crit3

AllCrit

0     True
1    False
2    False
3    False
dtype: bool